Revit 2027 API
BarTypeDiameterOptions Constructor
Overload List
Name | Description
BarTypeDiameterOptions() |  Constructs a new BarTypeDiameterOptions with default settings.
BarTypeDiameterOptions(RebarBarType) |  Constructs a new BarTypeDiameterOptions copying the diameter information from the bar type.
Top
See Also
Reference
BarTypeDiameterOptions Class
Autodesk.Revit.DB Namespace